Revit 2024 API
BumpMap Class
 A static class that provides access to the property names that appear in the BumpMap visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class BumpMap
Visual Basic
Public NotInheritable Class BumpMap
Visual C++
public ref class BumpMap abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.BumpMap
See Also
BumpMap Members
Autodesk.Revit.DB.Visual Namespace